Revit 2026 API

# CopyPasteOptions Methods

---

The CopyPasteOptions type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Dispose |  |
|  | Equals | Determines whether the specified object is equal to the current object.(Inherited from Object) |
|  | GetDuplicateTypeNamesHandler | Returns current duplicate type names handler or  if none is set. |
|  | GetHashCode | Serves as the default hash function.(Inherited from Object) |
|  | GetType | Gets the Type of the current instance.(Inherited from Object) |
|  | SetDuplicateTypeNamesHandler | Sets a custom duplicate type names handler. If this value is not set, the default handler is used. By default, Revit displays a modal dialog with options to either copy new types only, or cancel the operation. |
|  | ToString | Returns a string that represents the current object.(Inherited from Object) |

#### Reference

CopyPasteOptions Class

Autodesk.Revit.DB Namespace